Repository: Team-Chalkak/Snappie
Catalog: Chalkak/Resource/Localizable.xcstrings
Source language: en
Languages: ko

# %.1f
source: %.1fs
ko: %.1f초

# %.2f
source: %.2fs
ko: %.2f초

# Alert.나가기
source: Exit
ko: 나가기

# onboarding.step1.description
source: Record the clip you want and a guide is created automatically
ko: 원하는 장면을 찍으면 자동으로 촬영 가이드가 만들어져요

# onboarding.step2.description
source: After each take adjust the clip length
ko: 장면을 촬영할 때마다 간단히 길이만 조절해요

# onboarding.step3.description
source: Pick any shot you filmed and turn it into a guide
ko: 촬영한 장면 중 원하는 걸 골라 가이드로 바꿀 수 있어요

# 가이드 생성에 실패했어요 인물이 나오는 장면을 선택해주세요
source: Failed to Create Guide Please choose a scene with a person in it
ko: 가이드 생성에 실패했어요 인물이 나오는 장면을 선택해주세요

# 가이드 선택
source: Select Guide
ko: 가이드 선택

# 가이드 수정
source: Edit Guide
ko: 가이드 수정

# 가이드로 사용된 장면은 삭제할 수 없어요
source: This Clip Is a Guide
ko: 가이드로 사용된 장면은 삭제할 수 없어요

# 가이드로 사용하기
source: Use as Guide
ko: 가이드로 사용하기

# 나가기
source: Don’t Save
ko: 나가기

# 나의 프로젝트
source: My Projects
ko: 나의 프로젝트

# 남아있는 장면이 없으면 프로젝트가 삭제돼요
source: The project will be deleted if no clips remain
ko: 남아있는 장면이 없으면 프로젝트가 삭제돼요

# 내보내기 완료
source: Exported
ko: 내보내기 완료

# 내보내는 중...
source: Exporting…
ko: 내보내는 중...

# 다른 장면을 가이드로 지정한 후 장면을 삭제할 수 있어요
source: Select another clip as your guide before deleting this one
ko: 다른 장면을 가이드로 지정한 후 장면을 삭제할 수 있어요

# 다시 찍으시겠어요?
source: Retake Video?
ko: 다시 찍으시겠어요?

# 다음 장면을 이어서 촬영할까요?
source: Would you like to continue recording the next scene?
ko: 다음 장면을 이어서 촬영할까요?

# 마이크 접근 권한
source: Microphone Access
ko: 마이크 접근 권한

# 버튼을 눌러 장면 촬영 시작
source: Tap to record a clip
ko: 버튼을 눌러 장면 촬영 시작

# 사진 라이브러리 접근 권한이 필요해요
source: Photo Library Access Required
ko: 사진 라이브러리 접근 권한이 필요해요

# 삭제
source: Delete
ko: 삭제

# 새 프로젝트
source: New Project
ko: 새 프로젝트

# 새로운 이름을 입력해주세요
source: Please enter a new name
ko: 새로운 이름을 입력해주세요

# 설정 열기
source: Open Settings
ko: 설정 열기

# 설정으로 이동
source: Go to Settings
ko: 설정으로 이동

# 소리를 녹음하기 위해 접근 권한이 필요해요
source: Permission is required to record audio
ko: 소리를 녹음하기 위해 접근 권한이 필요해요

# 시작하기
source: Get started
ko: 시작하기

# 아직 생성된 프로젝트가 없어요 버튼을 눌러 새 프로젝트를 시작해볼까요?
source: No projects yet Create a new project to get started
ko: 아직 생성된 프로젝트가 없어요 버튼을 눌러 새 프로젝트를 시작해볼까요?

# 아직 추가된 장면이 없어요
source: No clips yet
ko: 아직 추가된 장면이 없어요

# 앱 설정에서 카메라와 마이크의 접근 설정을 허용해 주세요
source: Please allow camera and microphone access in the app settings
ko: 앱 설정에서 카메라와 마이크의 접근 설정을 허용해 주세요

# 영상 불러오는 중
source: Preparing…
ko: 영상 불러오는 중

# 영상을 녹화하기 위해 접근 권한이 필요해요
source: Permission is required to record video
ko: 영상을 녹화하기 위해 접근 권한이 필요해요

# 영상을 저장하려면 사진 라이브러리 접근 권한이 필요해요 설정에서 권한을 허용해주세요
source: Photo library access is required to save videos You can allow access in Settings
ko: 영상을 저장하려면 사진 라이브러리 접근 권한이 필요해요 설정에서 권한을 허용해주세요

# 완료
source: Done
ko: 완료

# 이름 변경
source: Rename
ko: 이름 변경

# 이어서 촬영하기
source: Continue Recording
ko: 이어서 촬영하기

# 작업 중인 프로젝트를 삭제할까요?
source: Delete This Project?
ko: 작업 중인 프로젝트를 삭제할까요?

# 장면 다듬기
source: Trim
ko: 장면 다듬기

# 장면 삭제
source: Delete
ko: 장면 삭제

# 장면 추가하기
source: Add a Clip
ko: 장면 추가하기

# 저장
source: Save
ko: 저장

# 저장 중...
source: Saving…
ko: 저장 중...

# 저장하기
source: Save
ko: 저장하기

# 저장하지 않으면 방금 편집한 내용이 사라져요
source: If you don’t save, your recent edits will be lost
ko: 저장하지 않으면 방금 편집한 내용이 사라져요

# 지금 나가면 방금 찍은 영상이 지워져요
source: If you leave now, the video you just recorded will be deleted
ko: 지금 나가면 방금 찍은 영상이 지워져요

# 지금 이어서 찍거나, 프로젝트를 마무리할 수 있어요
source: You can continue recording now or finish the project
ko: 지금 이어서 찍거나, 프로젝트를 마무리할 수 있어요

# 지금까지 찍은 장면은 저장돼요
source: All recorded clips will be saved
ko: 지금까지 찍은 장면은 저장돼요

# 촬영을 마치고 나갈까요?
source: Finish Recording?
ko: 촬영을 마치고 나갈까요?

# 촬영을 위한 가이드가 만들어졌어요
source: Your guide is ready
ko: 촬영을 위한 가이드가 만들어졌어요

# 취소
source: Cancel
ko: 취소

# 카메라 접근 권한
source: Camera Access
ko: 카메라 접근 권한

# 카메라와 마이크 접근 권한 필요
source: Camera and Microphone Access Required
ko: 카메라와 마이크 접근 권한 필요

# 편집 내용 저장됨
source: Changes Saved
ko: 편집 내용 저장됨

# 편집한 내용을 저장할까요?
source: Save Changes?
ko: 편집한 내용을 저장할까요?

# 프로젝트 삭제됨
source: Project Deleted
ko: 프로젝트 삭제됨

# 프로젝트 이름 변경
source: Rename Project
ko: 프로젝트 이름 변경

# 프로젝트 편집
source: Edit Project
ko: 프로젝트 편집

# 프로젝트가 저장되었습니다
source: Project Saved
ko: 프로젝트가 저장되었습니다

# 프로젝트를 삭제할까요?
source: Delete Project?
ko: 프로젝트를 삭제할까요?

# 프로젝트와 안에 있는 장면이 모두 삭제돼요
source: The project and all of its clips will be deleted
ko: 프로젝트와 안에 있는 장면이 모두 삭제돼요

# 확인
source: Confirm
ko: 확인
